// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
