// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
