// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 64: Задайте значение N. Напишите программу, которая выведет 
//все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
