// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

