// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

