// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

