//Задача 15

Console.Write ( " Укажите номер недели: " );
int  weakDay1  =  Convert.ToInt32 ( Console.ReadLine ( )) ;

if ( слабый день1  >  0  &&  слабый день1  <  8 ){
    if ( слабый день1  >  5 ){
        Console.Write( " День недели выходной ");
    }
    else  Console.Write ( " День недели не выходной " );
}  
Console.Write ( " Недопустимое значение " );


